### Report for degrades-dashboards on environment: dev

#### Terraform Format and Style 🖌`success`
<details><summary>Format Output</summary>

```


```

</details>

#### Terraform Initialization ⚙️`success`
<details><summary>Initialization Output</summary>

```

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing provider plugins...
- Finding hashicorp/aws versions matching "~> 5.0"...
- Installing hashicorp/aws v5.100.0...
- Installed hashicorp/aws v5.100.0 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

```

</details>

#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan (4 to add, 5 to change, 4 to destroy)</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.degrades_messages_sqs_receive will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "degrades_messages_sqs_receive" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:DeleteMessage",
              + "sqs:GetQueueAttributes",
              + "sqs:GetQueueUrl",
              + "sqs:ReceiveMessage",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # aws_cloudwatch_metric_alarm.degrades_dlq_new_message will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "degrades_dlq_new_message" {
      ~ dimensions                            = {
          ~ "QueueName" = "degrades_messages_deadletter_queue" -> "dev_degrades_message_queue_dlq"
        }
        id                                    = "degrades_dlq_message_alarm_dev"
        tags                                  = {}
        # (21 unchanged attributes hidden)
    }

  # aws_iam_policy.degrades_lambda_sqs_invoke will be updated in-place
  ~ resource "aws_iam_policy" "degrades_lambda_sqs_invoke" {
        id               = "arn:aws:iam::343515223843:policy/degrades_sqs_invoke_policy"
        name             = "degrades_sqs_invoke_policy"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "sqs:ReceiveMessage",
                          - "sqs:GetQueueUrl",
                          - "sqs:GetQueueAttributes",
                          - "sqs:DeleteMessage",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:sqs:eu-west-2:343515223843:degrades_messages_queue",
                          - "arn:aws:sqs:eu-west-2:343515223843:degrades_messages_deadletter_queue",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # aws_iam_policy.degrades_message_receiver_logging will be updated in-place
  ~ resource "aws_iam_policy" "degrades_message_receiver_logging" {
        id               = "arn:aws:iam::343515223843:policy/degrades_message_receiver_lambda_logging"
        name             = "degrades_message_receiver_lambda_logging"
      ~ policy           = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = [
                          - "arn:aws:logs:eu-west-2:343515223843:log-group:/aws/lambda/dev_degrades_message_receiver_lambda:*",
                          - "arn:aws:logs:eu-west-2:343515223843:log-group:/aws/lambda/dev_degrades_message_receiver_lambda",
                        ] -> "arn:aws:logs:eu-west-2:343515223843:log-group:/aws/lambda/dev_degrades_message_receiver_lambda"
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # aws_lambda_event_source_mapping.degrades_lambda must be replaced
-/+ resource "aws_lambda_event_source_mapping" "degrades_lambda" {
      ~ arn                                = "arn:aws:lambda:eu-west-2:343515223843:event-source-mapping:89ae5635-93d2-4274-9d84-9496c4eb6667" -> (known after apply)
      - batch_size                         = 10 -> null
      - bisect_batch_on_function_error     = false -> null
      ~ event_source_arn                   = "arn:aws:sqs:eu-west-2:343515223843:degrades_messages_queue" -> (known after apply) # forces replacement
      ~ function_arn                       = "arn:aws:lambda:eu-west-2:343515223843:function:dev_degrades_message_receiver_lambda" -> (known after apply)
      - function_response_types            = [] -> null
      ~ id                                 = "89ae5635-93d2-4274-9d84-9496c4eb6667" -> (known after apply)
      ~ last_modified                      = "2025-06-19T15:30:22Z" -> (known after apply)
      + last_processing_result             = (known after apply)
      - maximum_batching_window_in_seconds = 0 -> null
      ~ maximum_record_age_in_seconds      = 0 -> (known after apply)
      ~ maximum_retry_attempts             = 0 -> (known after apply)
      ~ parallelization_factor             = 0 -> (known after apply)
      - queues                             = [] -> null
      ~ state                              = "Enabled" -> (known after apply)
      ~ state_transition_reason            = "USER_INITIATED" -> (known after apply)
      - tags                               = {} -> null
      ~ tags_all                           = {} -> (known after apply)
      - topics                             = [] -> null
      - tumbling_window_in_seconds         = 0 -> null
      ~ uuid                               = "89ae5635-93d2-4274-9d84-9496c4eb6667" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ amazon_managed_kafka_event_source_config (known after apply)

      ~ self_managed_kafka_event_source_config (known after apply)
    }

  # aws_lambda_function.degrades_api_lambda will be updated in-place
  ~ resource "aws_lambda_function" "degrades_api_lambda" {
        id                             = "dev_degrades_api_dashboards_lambda"
      ~ last_modified                  = "2025-06-19T15:30:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "RIv8wX7M4MD+NwcSW+kIiYzVaamJTK9s3PdpucFWYag=" -> "OY2GzqoSvgeIwZdIMUp5HWzhWicncpIy41RX/YVNQ1M="
        tags                           = {}
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.degrades_message_receiver will be updated in-place
  ~ resource "aws_lambda_function" "degrades_message_receiver" {
        id                             = "dev_degrades_message_receiver_lambda"
      ~ last_modified                  = "2025-06-24T11:55:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "TDlZqQH4lLSzB0W59BSJ7I4rlBtLJgKvt70yWpah9S8=" -> "C7jdPIctm2srP6WvJ6fc4JLPxpcl1DC4fFq8UZDQWMM="
        tags                           = {}
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_sqs_queue.degrades_messages must be replaced
-/+ resource "aws_sqs_queue" "degrades_messages" {
      ~ arn                               = "arn:aws:sqs:eu-west-2:343515223843:degrades_messages_queue" -> (known after apply)
      + deduplication_scope               = (known after apply)
      + fifo_throughput_limit             = (known after apply)
      ~ id                                = "https://sqs.eu-west-2.amazonaws.com/343515223843/degrades_messages_queue" -> (known after apply)
      ~ kms_data_key_reuse_period_seconds = 300 -> (known after apply)
      ~ name                              = "degrades_messages_queue" -> "dev_degrades_message_queue" # forces replacement
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + redrive_allow_policy              = (known after apply)
      ~ redrive_policy                    = jsonencode(
            {
              - deadLetterTargetArn = "arn:aws:sqs:eu-west-2:343515223843:degrades_messages_deadletter_queue"
              - maxReceiveCount     = 3
            }
        ) -> (known after apply)
      ~ sqs_managed_sse_enabled           = true -> (known after apply)
      - tags                              = {} -> null
      ~ tags_all                          = {} -> (known after apply)
      ~ url                               = "https://sqs.eu-west-2.amazonaws.com/343515223843/degrades_messages_queue" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # aws_sqs_queue.degrades_messages_deadletter must be replaced
-/+ resource "aws_sqs_queue" "degrades_messages_deadletter" {
      ~ arn                               = "arn:aws:sqs:eu-west-2:343515223843:degrades_messages_deadletter_queue" -> (known after apply)
      + deduplication_scope               = (known after apply)
      + fifo_throughput_limit             = (known after apply)
      ~ id                                = "https://sqs.eu-west-2.amazonaws.com/343515223843/degrades_messages_deadletter_queue" -> (known after apply)
      ~ kms_data_key_reuse_period_seconds = 300 -> (known after apply)
      ~ name                              = "degrades_messages_deadletter_queue" -> "dev_degrades_message_queue_dlq" # forces replacement
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      ~ redrive_allow_policy              = jsonencode(
            {
              - redrivePermission = "byQueue"
              - sourceQueueArns   = [
                  - "arn:aws:sqs:eu-west-2:343515223843:degrades_messages_queue",
                ]
            }
        ) -> (known after apply)
      + redrive_policy                    = (known after apply)
      ~ sqs_managed_sse_enabled           = true -> (known after apply)
      - tags                              = {} -> null
      ~ tags_all                          = {} -> (known after apply)
      ~ url                               = "https://sqs.eu-west-2.amazonaws.com/343515223843/degrades_messages_deadletter_queue" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # aws_sqs_queue_redrive_allow_policy.degrades_message_queue_redrive_allow_policy must be replaced
-/+ resource "aws_sqs_queue_redrive_allow_policy" "degrades_message_queue_redrive_allow_policy" {
      ~ id                   = "https://sqs.eu-west-2.amazonaws.com/343515223843/degrades_messages_deadletter_queue" -> (known after apply)
      ~ queue_url            = "https://sqs.eu-west-2.amazonaws.com/343515223843/degrades_messages_deadletter_queue" -> (known after apply) # forces replacement
      ~ redrive_allow_policy = jsonencode(
            {
              - redrivePermission = "byQueue"
              - sourceQueueArns   = [
                  - "arn:aws:sqs:eu-west-2:343515223843:degrades_messages_queue",
                ]
            }
        ) -> (known after apply)
    }

Plan: 4 to add, 5 to change, 4 to destroy.

```

</details>